<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"60aae545c262b564c80319545670c305571d93244805ddcc4a103c6c659e2394","plan_job_ref":"Job Terraform Plan #115 at https://github.com/cal-itp/data-infra/actions/runs/14499686151","plan_out_hash":"6dd1d202179d96511c1d722e4dd739172d14da60473d588d07d588198122e234","plan_hash":"e9d0938a57c6d33d1741373871788bfd86889d3c9e7f50bc2ae7594e46187fad","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra/gcs/us__
<details>
<summary>Plan: 24 to add, 1 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket.tfer--calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket" "tfer--calitp-payments-littlepay-parsed-v3" {
+       default_event_based_hold    = false
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US-WEST2"
+       name                        = "calitp-payments-littlepay-parsed-v3"
+       project                     = "cal-itp-data-infra"
+       project_number              = (known after apply)
+       public_access_prevention    = "enforced"
+       requester_pays              = false
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       soft_delete_policy (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # google_storage_bucket.tfer--calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket" "tfer--calitp-payments-littlepay-raw-v3" {
+       default_event_based_hold    = false
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US-WEST2"
+       name                        = "calitp-payments-littlepay-raw-v3"
+       project                     = "cal-itp-data-infra"
+       project_number              = (known after apply)
+       public_access_prevention    = "enforced"
+       requester_pays              = false
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       soft_delete_policy (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # google_storage_bucket.tfer--rt-parsed-deprecated will be updated in-place
!~  resource "google_storage_bucket" "tfer--rt-parsed-deprecated" {
        id                          = "rt-parsed-deprecated"
        name                        = "rt-parsed-deprecated"
!~      terraform_labels            = {
+           "deprecated" = (known after apply)
        }
#        (14 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # google_storage_bucket.tfer--test-calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket" "tfer--test-calitp-payments-littlepay-parsed-v3" {
+       default_event_based_hold    = false
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US-WEST2"
+       name                        = "test-calitp-payments-littlepay-parsed-v3"
+       project                     = "cal-itp-data-infra"
+       project_number              = (known after apply)
+       public_access_prevention    = "enforced"
+       requester_pays              = false
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       lifecycle_rule {
+           action {
+               type          = "Delete"
#                (1 unchanged attribute hidden)
            }
+           condition {
+               age                        = 30
+               days_since_custom_time     = 0
+               days_since_noncurrent_time = 0
+               matches_prefix             = []
+               matches_storage_class      = []
+               matches_suffix             = []
+               num_newer_versions         = 0
+               with_state                 = "ANY"
#                (3 unchanged attributes hidden)
            }
        }

+       soft_delete_policy (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # google_storage_bucket.tfer--test-calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket" "tfer--test-calitp-payments-littlepay-raw-v3" {
+       default_event_based_hold    = false
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US-WEST2"
+       name                        = "test-calitp-payments-littlepay-raw-v3"
+       project                     = "cal-itp-data-infra"
+       project_number              = (known after apply)
+       public_access_prevention    = "enforced"
+       requester_pays              = false
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       lifecycle_rule {
+           action {
+               type          = "Delete"
#                (1 unchanged attribute hidden)
            }
+           condition {
+               age                        = 30
+               days_since_custom_time     = 0
+               days_since_noncurrent_time = 0
+               matches_prefix             = []
+               matches_storage_class      = []
+               matches_suffix             = []
+               num_newer_versions         = 0
+               with_state                 = "ANY"
#                (3 unchanged attributes hidden)
            }
        }

+       soft_delete_policy (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # google_storage_bucket_acl.tfer--calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket_acl" "tfer--calitp-payments-littlepay-parsed-v3" {
+       bucket      = "calitp-payments-littlepay-parsed-v3"
+       id          = (known after apply)
+       role_entity = (known after apply)
    }

  # google_storage_bucket_acl.tfer--calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket_acl" "tfer--calitp-payments-littlepay-raw-v3" {
+       bucket      = "calitp-payments-littlepay-raw-v3"
+       id          = (known after apply)
+       role_entity = (known after apply)
    }

  # google_storage_bucket_acl.tfer--test-calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket_acl" "tfer--test-calitp-payments-littlepay-parsed-v3" {
+       bucket      = "test-calitp-payments-littlepay-parsed-v3"
+       id          = (known after apply)
+       role_entity = (known after apply)
    }

  # google_storage_bucket_acl.tfer--test-calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket_acl" "tfer--test-calitp-payments-littlepay-raw-v3" {
+       bucket      = "test-calitp-payments-littlepay-raw-v3"
+       id          = (known after apply)
+       role_entity = (known after apply)
    }

  # google_storage_bucket_iam_binding.tfer--calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket_iam_binding" "tfer--calitp-payments-littlepay-parsed-v3" {
+       bucket  = "b/calitp-payments-littlepay-parsed-v3"
+       etag    = (known after apply)
+       id      = (known after apply)
+       members = [
+           "projectEditor:cal-itp-data-infra",
+           "projectOwner:cal-itp-data-infra",
        ]
+       role    = "roles/storage.legacyObjectOwner"
    }

  # google_storage_bucket_iam_binding.tfer--calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket_iam_binding" "tfer--calitp-payments-littlepay-raw-v3" {
+       bucket  = "b/calitp-payments-littlepay-raw-v3"
+       etag    = (known after apply)
+       id      = (known after apply)
+       members = [
+           "projectEditor:cal-itp-data-infra",
+           "projectOwner:cal-itp-data-infra",
        ]
+       role    = "roles/storage.legacyBucketOwner"
    }

  # google_storage_bucket_iam_binding.tfer--test-calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket_iam_binding" "tfer--test-calitp-payments-littlepay-parsed-v3" {
+       bucket  = "b/test-calitp-payments-littlepay-parsed-v3"
+       etag    = (known after apply)
+       id      = (known after apply)
+       members = [
+           "projectViewer:cal-itp-data-infra",
        ]
+       role    = "roles/storage.legacyBucketReader"
    }

  # google_storage_bucket_iam_binding.tfer--test-calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket_iam_binding" "tfer--test-calitp-payments-littlepay-raw-v3" {
+       bucket  = "b/test-calitp-payments-littlepay-raw-v3"
+       etag    = (known after apply)
+       id      = (known after apply)
+       members = [
+           "projectViewer:cal-itp-data-infra",
        ]
+       role    = "roles/storage.legacyBucketReader"
    }

  # google_storage_bucket_iam_member.tfer--calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket_iam_member" "tfer--calitp-payments-littlepay-parsed-v3" {
+       bucket = "b/calitp-payments-littlepay-parsed-v3"
+       etag   = (known after apply)
+       id     = (known after apply)
+       member = "projectEditor:cal-itp-data-infra"
+       role   = "roles/storage.legacyBucketOwner"
    }

  # google_storage_bucket_iam_member.tfer--calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket_iam_member" "tfer--calitp-payments-littlepay-raw-v3" {
+       bucket = "b/calitp-payments-littlepay-raw-v3"
+       etag   = (known after apply)
+       id     = (known after apply)
+       member = "projectViewer:cal-itp-data-infra"
+       role   = "roles/storage.legacyBucketReader"
    }

  # google_storage_bucket_iam_member.tfer--test-calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket_iam_member" "tfer--test-calitp-payments-littlepay-parsed-v3" {
+       bucket = "b/test-calitp-payments-littlepay-parsed-v3"
+       etag   = (known after apply)
+       id     = (known after apply)
+       member = "projectEditor:cal-itp-data-infra"
+       role   = "roles/storage.legacyObjectOwner"
    }

  # google_storage_bucket_iam_member.tfer--test-calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket_iam_member" "tfer--test-calitp-payments-littlepay-raw-v3" {
+       bucket = "b/test-calitp-payments-littlepay-raw-v3"
+       etag   = (known after apply)
+       id     = (known after apply)
+       member = "projectOwner:cal-itp-data-infra"
+       role   = "roles/storage.legacyBucketOwner"
    }

  # google_storage_bucket_iam_policy.tfer--calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket_iam_policy" "tfer--calitp-payments-littlepay-parsed-v3" {
+       bucket      = "b/calitp-payments-littlepay-parsed-v3"
+       etag        = (known after apply)
+       id          = (known after apply)
+       policy_data = jsonencode(
            {
+               bindings = [
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra",
+                           "projectOwner:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyBucketOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyBucketReader"
                    },
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra",
+                           "projectOwner:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyObjectOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyObjectReader"
                    },
                ]
            }
        )
    }

  # google_storage_bucket_iam_policy.tfer--calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket_iam_policy" "tfer--calitp-payments-littlepay-raw-v3" {
+       bucket      = "b/calitp-payments-littlepay-raw-v3"
+       etag        = (known after apply)
+       id          = (known after apply)
+       policy_data = jsonencode(
            {
+               bindings = [
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra",
+                           "projectOwner:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyBucketOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyBucketReader"
                    },
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra",
+                           "projectOwner:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyObjectOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyObjectReader"
                    },
                ]
            }
        )
    }

  # google_storage_bucket_iam_policy.tfer--test-calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_bucket_iam_policy" "tfer--test-calitp-payments-littlepay-parsed-v3" {
+       bucket      = "b/test-calitp-payments-littlepay-parsed-v3"
+       etag        = (known after apply)
+       id          = (known after apply)
+       policy_data = jsonencode(
            {
+               bindings = [
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra",
+                           "projectOwner:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyBucketOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyBucketReader"
                    },
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra",
+                           "projectOwner:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyObjectOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyObjectReader"
                    },
                ]
            }
        )
    }

  # google_storage_bucket_iam_policy.tfer--test-calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_bucket_iam_policy" "tfer--test-calitp-payments-littlepay-raw-v3" {
+       bucket      = "b/test-calitp-payments-littlepay-raw-v3"
+       etag        = (known after apply)
+       id          = (known after apply)
+       policy_data = jsonencode(
            {
+               bindings = [
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra",
+                           "projectOwner:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyBucketOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyBucketReader"
                    },
+                   {
+                       members = [
+                           "projectEditor:cal-itp-data-infra",
+                           "projectOwner:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyObjectOwner"
                    },
+                   {
+                       members = [
+                           "projectViewer:cal-itp-data-infra",
                        ]
+                       role    = "roles/storage.legacyObjectReader"
                    },
                ]
            }
        )
    }

  # google_storage_default_object_acl.tfer--calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_default_object_acl" "tfer--calitp-payments-littlepay-parsed-v3" {
+       bucket      = "calitp-payments-littlepay-parsed-v3"
+       id          = (known after apply)
+       role_entity = (known after apply)
    }

  # google_storage_default_object_acl.tfer--calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_default_object_acl" "tfer--calitp-payments-littlepay-raw-v3" {
+       bucket      = "calitp-payments-littlepay-raw-v3"
+       id          = (known after apply)
+       role_entity = (known after apply)
    }

  # google_storage_default_object_acl.tfer--test-calitp-payments-littlepay-parsed-v3 will be created
+   resource "google_storage_default_object_acl" "tfer--test-calitp-payments-littlepay-parsed-v3" {
+       bucket      = "test-calitp-payments-littlepay-parsed-v3"
+       id          = (known after apply)
+       role_entity = (known after apply)
    }

  # google_storage_default_object_acl.tfer--test-calitp-payments-littlepay-raw-v3 will be created
+   resource "google_storage_default_object_acl" "tfer--test-calitp-payments-littlepay-raw-v3" {
+       bucket      = "test-calitp-payments-littlepay-raw-v3"
+       id          = (known after apply)
+       role_entity = (known after apply)
    }

Plan: 24 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+   google_storage_bucket_acl_tfer--calitp-payments-littlepay-parsed-v3_id                                     = (known after apply)
+   google_storage_bucket_acl_tfer--calitp-payments-littlepay-raw-v3_id                                        = (known after apply)
+   google_storage_bucket_acl_tfer--test-calitp-payments-littlepay-parsed-v3_id                                = (known after apply)
+   google_storage_bucket_acl_tfer--test-calitp-payments-littlepay-raw-v3_id                                   = (known after apply)
+   google_storage_bucket_iam_binding_tfer--calitp-payments-littlepay-parsed-v3_id                             = (known after apply)
+   google_storage_bucket_iam_binding_tfer--calitp-payments-littlepay-raw-v3_id                                = (known after apply)
+   google_storage_bucket_iam_binding_tfer--test-calitp-payments-littlepay-parsed-v3_id                        = (known after apply)
+   google_storage_bucket_iam_binding_tfer--test-calitp-payments-littlepay-raw-v3_id                           = (known after apply)
+   google_storage_bucket_iam_member_tfer--calitp-payments-littlepay-parsed-v3_id                              = (known after apply)
+   google_storage_bucket_iam_member_tfer--calitp-payments-littlepay-raw-v3_id                                 = (known after apply)
+   google_storage_bucket_iam_member_tfer--test-calitp-payments-littlepay-parsed-v3_id                         = (known after apply)
+   google_storage_bucket_iam_member_tfer--test-calitp-payments-littlepay-raw-v3_id                            = (known after apply)
+   google_storage_bucket_iam_policy_tfer--calitp-payments-littlepay-parsed-v3_id                              = (known after apply)
+   google_storage_bucket_iam_policy_tfer--calitp-payments-littlepay-raw-v3_id                                 = (known after apply)
+   google_storage_bucket_iam_policy_tfer--test-calitp-payments-littlepay-parsed-v3_id                         = (known after apply)
+   google_storage_bucket_iam_policy_tfer--test-calitp-payments-littlepay-raw-v3_id                            = (known after apply)
+   google_storage_bucket_tfer--calitp-payments-littlepay-parsed-v3_name                                       = "calitp-payments-littlepay-parsed-v3"
+   google_storage_bucket_tfer--calitp-payments-littlepay-parsed-v3_self_link                                  = (known after apply)
+   google_storage_bucket_tfer--calitp-payments-littlepay-raw-v3_name                                          = "calitp-payments-littlepay-raw-v3"
+   google_storage_bucket_tfer--calitp-payments-littlepay-raw-v3_self_link                                     = (known after apply)
+   google_storage_bucket_tfer--test-calitp-payments-littlepay-parsed-v3_name                                  = "test-calitp-payments-littlepay-parsed-v3"
+   google_storage_bucket_tfer--test-calitp-payments-littlepay-parsed-v3_self_link                             = (known after apply)
+   google_storage_bucket_tfer--test-calitp-payments-littlepay-raw-v3_name                                     = "test-calitp-payments-littlepay-raw-v3"
+   google_storage_bucket_tfer--test-calitp-payments-littlepay-raw-v3_self_link                                = (known after apply)
+   google_storage_default_object_acl_tfer--calitp-payments-littlepay-parsed-v3_id                             = (known after apply)
+   google_storage_default_object_acl_tfer--calitp-payments-littlepay-raw-v3_id                                = (known after apply)
+   google_storage_default_object_acl_tfer--test-calitp-payments-littlepay-parsed-v3_id                        = (known after apply)
+   google_storage_default_object_acl_tfer--test-calitp-payments-littlepay-raw-v3_id                           = (known after apply)
```
</details>

:memo: Plan generated in [Terraform Plan #115](https://github.com/cal-itp/data-infra/actions/runs/14499686151)